[Killed] MethodExpression
src/lib/app-error.ts:27:33
 
   /** 502 — a downstream dependency (Gemini, Firestore) failed. */
   static upstreamFailure(dependency: string, message: string): AppError {
-    return new AppError(502, `${dependency.toUpperCase()}_UNAVAILABLE`, message);
+    return new AppError(502, `${dependency.toLowerCase()}_UNAVAILABLE`, message);
   }
 }
killedBy: AppError creates upstreamFailure error correctly
statusReason: expected 'gemini_UNAVAILABLE' to be 'GEMINI_UNAVAILABLE' // Object.is equality
