[Killed] EqualityOperator
src/lib/ttl-cache.ts:26:9
     if (!entry) {
       return undefined;
     }
-    if (entry.expiresAt <= Date.now()) {
+    if (entry.expiresAt > Date.now()) {
       this.entries.delete(key);
       return undefined;
killedBy: TtlCache returns a stored value before its TTL expires
statusReason: expected undefined to be 'v' // Object.is equality

[Killed] BlockStatement
src/lib/ttl-cache.ts:26:40
     if (!entry) {
       return undefined;
     }
-    if (entry.expiresAt <= Date.now()) {
-      this.entries.delete(key);
-      return undefined;
-    }
+    if (entry.expiresAt <= Date.now()) {}
     return entry.value;
   }
killedBy: TtlCache expires values after the TTL
statusReason: expected 'v' to be undefined

[Killed] BlockStatement
src/lib/ttl-cache.ts:34:36
   }
 
   /** Stores `value` under `key`, evicting the oldest entry when full. */
-  set(key: string, value: T): void {
-    if (this.entries.size >= this.maxEntries && !this.entries.has(key)) {
-      const oldestKey = this.entries.keys().next().value;
-      if (oldestKey !== undefined) {
-        this.entries.delete(oldestKey);
-      }
-    }
-    this.entries.set(key, { value, expiresAt: Date.now() + this.ttlMs });
-  }
+  set(key: string, value: T): void {}
 
   /** Removes every entry (used by tests). */
killedBy: TtlCache returns a stored value before its TTL expires
statusReason: expected undefined to be 'v' // Object.is equality

[Killed] BooleanLiteral
src/lib/ttl-cache.ts:35:49
 
   /** Stores `value` under `key`, evicting the oldest entry when full. */
   set(key: string, value: T): void {
-    if (this.entries.size >= this.maxEntries && !this.entries.has(key)) {
+    if (this.entries.size >= this.maxEntries && this.entries.has(key)) {
       const oldestKey = this.entries.keys().next().value;
       if (oldestKey !== undefined) {
killedBy: TtlCache evicts the oldest entry once the max size is reached
statusReason: expected 1 to be undefined

[Killed] EqualityOperator
src/lib/ttl-cache.ts:35:9
 
   /** Stores `value` under `key`, evicting the oldest entry when full. */
   set(key: string, value: T): void {
-    if (this.entries.size >= this.maxEntries && !this.entries.has(key)) {
+    if (this.entries.size > this.maxEntries && !this.entries.has(key)) {
       const oldestKey = this.entries.keys().next().value;
       if (oldestKey !== undefined) {
killedBy: TtlCache evicts the oldest entry once the max size is reached
statusReason: expected 1 to be undefined

[Killed] BlockStatement
src/lib/ttl-cache.ts:37:36
   set(key: string, value: T): void {
     if (this.entries.size >= this.maxEntries && !this.entries.has(key)) {
       const oldestKey = this.entries.keys().next().value;
-      if (oldestKey !== undefined) {
-        this.entries.delete(oldestKey);
-      }
+      if (oldestKey !== undefined) {}
     }
     this.entries.set(key, { value, expiresAt: Date.now() + this.ttlMs });
killedBy: TtlCache evicts the oldest entry once the max size is reached
statusReason: expected 1 to be undefined

[Killed] ArithmeticOperator
src/lib/ttl-cache.ts:41:47
         this.entries.delete(oldestKey);
       }
     }
-    this.entries.set(key, { value, expiresAt: Date.now() + this.ttlMs });
+    this.entries.set(key, { value, expiresAt: Date.now() - this.ttlMs });
   }
 
killedBy: TtlCache returns a stored value before its TTL expires
statusReason: expected undefined to be 'v' // Object.is equality

[Killed] BlockStatement
src/lib/ttl-cache.ts:45:17
   }
 
   /** Removes every entry (used by tests). */
-  clear(): void {
-    this.entries.clear();
-  }
+  clear(): void {}
 }
 
killedBy: TtlCache clear removes every entry
statusReason: expected 'v' to be undefined
