[Killed] ArrowFunction
src/lib/async-utils.ts:3:22
 /** A simple promise-based delay helper. */
 export function delay(ms: number): Promise<void> {
-  return new Promise((resolve) => setTimeout(resolve, ms));
+  return new Promise(() => undefined);
 }
 
killedBy: async-utils delay should wait for at least the specified time
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/lib/async-utils.ts:15:9
   try {
     return await fn();
   } catch (error) {
-    if (retries <= 0) {
+    if (true) {
       throw error;
     }
killedBy: async-utils retryWithDelay should retry if the function fails and eventually succeed
statusReason: fail

[Killed] EqualityOperator
src/lib/async-utils.ts:15:9
   try {
     return await fn();
   } catch (error) {
-    if (retries <= 0) {
+    if (retries > 0) {
       throw error;
     }
killedBy: async-utils retryWithDelay should retry if the function fails and eventually succeed
statusReason: fail

[Survived] BlockStatement
src/lib/async-utils.ts:18:22
     if (retries <= 0) {
       throw error;
     }
-    if (delayMs > 0) {
-      await delay(delayMs);
-    }
+    if (delayMs > 0) {}
     return retryWithDelay(fn, retries - 1, delayMs);
   }

[Survived] EqualityOperator
src/lib/async-utils.ts:18:9
     if (retries <= 0) {
       throw error;
     }
-    if (delayMs > 0) {
+    if (delayMs <= 0) {
       await delay(delayMs);
     }

[Killed] ArithmeticOperator
src/lib/async-utils.ts:21:31
     if (delayMs > 0) {
       await delay(delayMs);
     }
-    return retryWithDelay(fn, retries - 1, delayMs);
+    return retryWithDelay(fn, retries + 1, delayMs);
   }
 }
killedBy: async-utils retryWithDelay should throw the error if all retries fail
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/lib/async-utils.ts:32:60
   errorMessage: string = 'Operation timed out',
 ): Promise<T> {
   let timeoutId: NodeJS.Timeout | undefined;
-  const timeoutPromise = new Promise<never>((_, reject) => {
-    timeoutId = setTimeout(() => reject(new Error(errorMessage)), timeoutMs);
-  });
+  const timeoutPromise = new Promise<never>((_, reject) => {});
   return Promise.race([promise, timeoutPromise]).finally(() => {
     if (timeoutId) {
killedBy: async-utils withTimeout should reject if the promise times out with custom message
statusReason: promise resolved "'done'" instead of rejecting

[Killed] ArrowFunction
src/lib/async-utils.ts:33:28
 ): Promise<T> {
   let timeoutId: NodeJS.Timeout | undefined;
   const timeoutPromise = new Promise<never>((_, reject) => {
-    timeoutId = setTimeout(() => reject(new Error(errorMessage)), timeoutMs);
+    timeoutId = setTimeout(() => undefined, timeoutMs);
   });
   return Promise.race([promise, timeoutPromise]).finally(() => {
killedBy: async-utils withTimeout should reject if the promise times out with custom message
statusReason: promise resolved "'done'" instead of rejecting

[Killed] BlockStatement
src/lib/async-utils.ts:35:64
   const timeoutPromise = new Promise<never>((_, reject) => {
     timeoutId = setTimeout(() => reject(new Error(errorMessage)), timeoutMs);
   });
-  return Promise.race([promise, timeoutPromise]).finally(() => {
-    if (timeoutId) {
-      clearTimeout(timeoutId);
-    }
-  });
+  return Promise.race([promise, timeoutPromise]).finally(() => {});
 }
 
killedBy: async-utils withTimeout should clear timeout when the promise resolves immediately
statusReason: expected "clearTimeout" to be called at least once

[Killed] BlockStatement
src/lib/async-utils.ts:36:20
     timeoutId = setTimeout(() => reject(new Error(errorMessage)), timeoutMs);
   });
   return Promise.race([promise, timeoutPromise]).finally(() => {
-    if (timeoutId) {
-      clearTimeout(timeoutId);
-    }
+    if (timeoutId) {}
   });
 }
killedBy: async-utils withTimeout should clear timeout when the promise resolves immediately
statusReason: expected "clearTimeout" to be called at least once

[Killed] ConditionalExpression
src/lib/async-utils.ts:36:9
     timeoutId = setTimeout(() => reject(new Error(errorMessage)), timeoutMs);
   });
   return Promise.race([promise, timeoutPromise]).finally(() => {
-    if (timeoutId) {
+    if (false) {
       clearTimeout(timeoutId);
     }
killedBy: async-utils withTimeout should clear timeout when the promise resolves immediately
statusReason: expected "clearTimeout" to be called at least once
