[Killed] ArithmeticOperator
src/features/operations/crowd.ts:15:33
 
 /** Derives dashboard density percentage and crowd status from a zone record. */
 export function toZoneOccupancy(zone: ZoneRecord): ZoneOccupancy {
-  const densityPct = Math.round((zone.occupancy / zone.capacity) * 100);
+  const densityPct = Math.round(zone.occupancy / zone.capacity / 100);
   const status =
     densityPct >= DENSITY_CRITICAL_PCT
killedBy: ensureSeeded / getSnapshot / advanceTelemetry advanceTelemetry keeps every zone inside simulated density bounds
statusReason: expected 0 to be greater than or equal to 15

[Killed] ArithmeticOperator
src/features/operations/crowd.ts:15:34
 
 /** Derives dashboard density percentage and crowd status from a zone record. */
 export function toZoneOccupancy(zone: ZoneRecord): ZoneOccupancy {
-  const densityPct = Math.round((zone.occupancy / zone.capacity) * 100);
+  const densityPct = Math.round((zone.occupancy * zone.capacity) * 100);
   const status =
     densityPct >= DENSITY_CRITICAL_PCT
killedBy: ensureSeeded / getSnapshot / advanceTelemetry advanceTelemetry keeps every zone inside simulated density bounds
statusReason: expected 24624000000 to be less than or equal to 98

[Killed] ConditionalExpression
src/features/operations/crowd.ts:17:5
 export function toZoneOccupancy(zone: ZoneRecord): ZoneOccupancy {
   const densityPct = Math.round((zone.occupancy / zone.capacity) * 100);
   const status =
-    densityPct >= DENSITY_CRITICAL_PCT
+    true
       ? 'critical'
       : densityPct >= DENSITY_BUSY_PCT
killedBy: toZoneOccupancy derives density percentage from occupancy and capacity
statusReason: expected 'critical' to be 'comfortable' // Object.is equality

[Killed] EqualityOperator
src/features/operations/crowd.ts:17:5
 export function toZoneOccupancy(zone: ZoneRecord): ZoneOccupancy {
   const densityPct = Math.round((zone.occupancy / zone.capacity) * 100);
   const status =
-    densityPct >= DENSITY_CRITICAL_PCT
+    densityPct < DENSITY_CRITICAL_PCT
       ? 'critical'
       : densityPct >= DENSITY_BUSY_PCT
killedBy: toZoneOccupancy derives density percentage from occupancy and capacity
statusReason: expected 'critical' to be 'comfortable' // Object.is equality

[Killed] ConditionalExpression
src/features/operations/crowd.ts:19:9
   const status =
     densityPct >= DENSITY_CRITICAL_PCT
       ? 'critical'
-      : densityPct >= DENSITY_BUSY_PCT
+      : true
         ? 'busy'
         : 'comfortable';
killedBy: toZoneOccupancy derives density percentage from occupancy and capacity
statusReason: expected 'busy' to be 'comfortable' // Object.is equality

[Killed] ConditionalExpression
src/features/operations/crowd.ts:19:9
   const status =
     densityPct >= DENSITY_CRITICAL_PCT
       ? 'critical'
-      : densityPct >= DENSITY_BUSY_PCT
+      : false
         ? 'busy'
         : 'comfortable';
killedBy: toZoneOccupancy flags a zone busy at 65% density and critical at 85%
statusReason: expected 'comfortable' to be 'busy' // Object.is equality

[Killed] ArithmeticOperator
src/features/operations/crowd.ts:33:20
  * @param random - Injectable source of randomness for deterministic tests.
  */
 export function nextOccupancy(zone: ZoneRecord, random: () => number = Math.random): number {
-  const stepPct = (random() * 2 - 1) * TELEMETRY_MAX_STEP_PCT;
+  const stepPct = (random() * 2 + 1) * TELEMETRY_MAX_STEP_PCT;
   const proposed = zone.occupancy + Math.round((stepPct / 100) * zone.capacity);
   const min = Math.round((TELEMETRY_MIN_DENSITY_PCT / 100) * zone.capacity);
killedBy: nextOccupancy moves occupancy by exactly the configured step based on random feedback
statusReason: expected 6800 to be 5600 // Object.is equality

[Killed] ArithmeticOperator
src/features/operations/crowd.ts:33:19
  * @param random - Injectable source of randomness for deterministic tests.
  */
 export function nextOccupancy(zone: ZoneRecord, random: () => number = Math.random): number {
-  const stepPct = (random() * 2 - 1) * TELEMETRY_MAX_STEP_PCT;
+  const stepPct = (random() * 2 - 1) / TELEMETRY_MAX_STEP_PCT;
   const proposed = zone.occupancy + Math.round((stepPct / 100) * zone.capacity);
   const min = Math.round((TELEMETRY_MIN_DENSITY_PCT / 100) * zone.capacity);
killedBy: nextOccupancy moves occupancy by exactly the configured step based on random feedback
statusReason: expected 5017 to be 5600 // Object.is equality

[Killed] ArithmeticOperator
src/features/operations/crowd.ts:34:20
  */
 export function nextOccupancy(zone: ZoneRecord, random: () => number = Math.random): number {
   const stepPct = (random() * 2 - 1) * TELEMETRY_MAX_STEP_PCT;
-  const proposed = zone.occupancy + Math.round((stepPct / 100) * zone.capacity);
+  const proposed = zone.occupancy - Math.round(stepPct / 100 * zone.capacity);
   const min = Math.round((TELEMETRY_MIN_DENSITY_PCT / 100) * zone.capacity);
   const max = Math.round((TELEMETRY_MAX_DENSITY_PCT / 100) * zone.capacity);
killedBy: nextOccupancy moves occupancy by exactly the configured step based on random feedback
statusReason: expected 4400 to be 5600 // Object.is equality

[Killed] ArithmeticOperator
src/features/operations/crowd.ts:34:48
  */
 export function nextOccupancy(zone: ZoneRecord, random: () => number = Math.random): number {
   const stepPct = (random() * 2 - 1) * TELEMETRY_MAX_STEP_PCT;
-  const proposed = zone.occupancy + Math.round((stepPct / 100) * zone.capacity);
+  const proposed = zone.occupancy + Math.round(stepPct / 100 / zone.capacity);
   const min = Math.round((TELEMETRY_MIN_DENSITY_PCT / 100) * zone.capacity);
   const max = Math.round((TELEMETRY_MAX_DENSITY_PCT / 100) * zone.capacity);
killedBy: nextOccupancy moves occupancy by exactly the configured step based on random feedback
statusReason: expected 5000 to be 5600 // Object.is equality

[Killed] ArithmeticOperator
src/features/operations/crowd.ts:35:27
 export function nextOccupancy(zone: ZoneRecord, random: () => number = Math.random): number {
   const stepPct = (random() * 2 - 1) * TELEMETRY_MAX_STEP_PCT;
   const proposed = zone.occupancy + Math.round((stepPct / 100) * zone.capacity);
-  const min = Math.round((TELEMETRY_MIN_DENSITY_PCT / 100) * zone.capacity);
+  const min = Math.round((TELEMETRY_MIN_DENSITY_PCT * 100) * zone.capacity);
   const max = Math.round((TELEMETRY_MAX_DENSITY_PCT / 100) * zone.capacity);
   return Math.min(max, Math.max(min, proposed));
killedBy: nextOccupancy moves occupancy by exactly the configured step based on random feedback
statusReason: expected 9800 to be 5600 // Object.is equality

[Killed] ArithmeticOperator
src/features/operations/crowd.ts:35:26
 export function nextOccupancy(zone: ZoneRecord, random: () => number = Math.random): number {
   const stepPct = (random() * 2 - 1) * TELEMETRY_MAX_STEP_PCT;
   const proposed = zone.occupancy + Math.round((stepPct / 100) * zone.capacity);
-  const min = Math.round((TELEMETRY_MIN_DENSITY_PCT / 100) * zone.capacity);
+  const min = Math.round(TELEMETRY_MIN_DENSITY_PCT / 100 / zone.capacity);
   const max = Math.round((TELEMETRY_MAX_DENSITY_PCT / 100) * zone.capacity);
   return Math.min(max, Math.max(min, proposed));
killedBy: nextOccupancy never drops below the minimum simulated density
statusReason: expected 1000 to be greater than or equal to 1500

[Killed] ArithmeticOperator
src/features/operations/crowd.ts:36:27
   const stepPct = (random() * 2 - 1) * TELEMETRY_MAX_STEP_PCT;
   const proposed = zone.occupancy + Math.round((stepPct / 100) * zone.capacity);
   const min = Math.round((TELEMETRY_MIN_DENSITY_PCT / 100) * zone.capacity);
-  const max = Math.round((TELEMETRY_MAX_DENSITY_PCT / 100) * zone.capacity);
+  const max = Math.round((TELEMETRY_MAX_DENSITY_PCT * 100) * zone.capacity);
   return Math.min(max, Math.max(min, proposed));
 }
killedBy: nextOccupancy never exceeds the maximum simulated density
statusReason: expected 10300 to be less than or equal to 9800

[Killed] ArithmeticOperator
src/features/operations/crowd.ts:36:26
   const stepPct = (random() * 2 - 1) * TELEMETRY_MAX_STEP_PCT;
   const proposed = zone.occupancy + Math.round((stepPct / 100) * zone.capacity);
   const min = Math.round((TELEMETRY_MIN_DENSITY_PCT / 100) * zone.capacity);
-  const max = Math.round((TELEMETRY_MAX_DENSITY_PCT / 100) * zone.capacity);
+  const max = Math.round(TELEMETRY_MAX_DENSITY_PCT / 100 / zone.capacity);
   return Math.min(max, Math.max(min, proposed));
 }
killedBy: nextOccupancy never drops below the minimum simulated density
statusReason: expected 0 to be greater than or equal to 1500

[Killed] MethodExpression
src/features/operations/crowd.ts:37:24
   const proposed = zone.occupancy + Math.round((stepPct / 100) * zone.capacity);
   const min = Math.round((TELEMETRY_MIN_DENSITY_PCT / 100) * zone.capacity);
   const max = Math.round((TELEMETRY_MAX_DENSITY_PCT / 100) * zone.capacity);
-  return Math.min(max, Math.max(min, proposed));
+  return Math.min(max, Math.min(min, proposed));
 }
 
killedBy: nextOccupancy never drops below the minimum simulated density
statusReason: expected 1000 to be greater than or equal to 1500

[Killed] MethodExpression
src/features/operations/crowd.ts:37:10
   const proposed = zone.occupancy + Math.round((stepPct / 100) * zone.capacity);
   const min = Math.round((TELEMETRY_MIN_DENSITY_PCT / 100) * zone.capacity);
   const max = Math.round((TELEMETRY_MAX_DENSITY_PCT / 100) * zone.capacity);
-  return Math.min(max, Math.max(min, proposed));
+  return Math.max(max, Math.max(min, proposed));
 }
 
killedBy: nextOccupancy never exceeds the maximum simulated density
statusReason: expected 10300 to be less than or equal to 9800
